import json

answer = []

def record():
    
    text = ""
    fileName = input('Название вопросника на англиском: \n')
    while text != "Stop":
        text = input('Ведите слова для записи их в таком образе: Слово          Перевод \n Если вы закончили можете прописать команду Stop \n') 
        
        if text != "Stop": 
            answer.append(text)
            print(answer)
            continue
            
        else:
            with open(f'{fileName}.json', 'w') as f:
                 json.dump(answer, f)

print(""" __                                                    __     __                                                            __          
/  |                                                  /  |   /  |                                                          /  |         
$$ |       ______   ______   ______  _______         _$$ |_  $$ |____   ______         __   __   __  ______   ______   ____$$ | _______ 
$$ |      /      \ /      \ /      \/       \       / $$   | $$      \ /      \       /  | /  | /  |/      \ /      \ /    $$ |/       |
$$ |     /$$$$$$  |$$$$$$  /$$$$$$  $$$$$$$  |      $$$$$$/  $$$$$$$  /$$$$$$  |      $$ | $$ | $$ /$$$$$$  /$$$$$$  /$$$$$$$ /$$$$$$$/ 
$$ |     $$    $$ |/    $$ $$ |  $$/$$ |  $$ |        $$ | __$$ |  $$ $$    $$ |      $$ | $$ | $$ $$ |  $$ $$ |  $$/$$ |  $$ $$      \ 
$$ |_____$$$$$$$$//$$$$$$$ $$ |     $$ |  $$ |        $$ |/  $$ |  $$ $$$$$$$$/       $$ \_$$ \_$$ $$ \__$$ $$ |     $$ \__$$ |$$$$$$  |
$$       $$       $$    $$ $$ |     $$ |  $$ |        $$  $$/$$ |  $$ $$       |      $$   $$   $$/$$    $$/$$ |     $$    $$ /     $$/ 
$$$$$$$$/ $$$$$$$/ $$$$$$$/$$/      $$/   $$/          $$$$/ $$/   $$/ $$$$$$$/        $$$$$/$$$$/  $$$$$$/ $$/       $$$$$$$/$$$$$$$/  
                                                                                                                                        
                                                                                                                                        
                                                                                                                                        """)
record()